Xorlent/ESP32IMDB/src/ESP32IMDB.cpp
/*
 * ESP32IMDB - Simple In-Memory Database Engine for ESP32
 * 
 * Copyright (c) 2026 Xorlent
 * Licensed under the MIT License. See LICENSE file in the project root.
 * https://github.com/Xorlent/ESP32IMDB
 * 
 * A lightweight, thread-safe in-memory database with support for:
 * - Signed 32-bit integers
 * - 32-bit floating point numbers
 * - MAC addresses (6 bytes)
 * - String values up to 255 bytes
 * - Epoch dates (Unix timestamps)
 * - Boolean values
 * 
 * Features:
 * - Thread-safe operations using FreeRTOS mutexes
 * - Time-to-live (TTL) support with automatic record expiration
 * - Memory-efficient string compaction
 * - Simple, beginner-friendly API
 * - Configurable heap limit protection
 */

#include "ESP32IMDB.h"
#include <string.h>
#include <stdlib.h>
#if IMDB_ENABLE_PERSISTENCE
#include <SPIFFS.h>
#endif

// Constructor
ESP32IMDB::ESP32IMDB() {
  _columns = nullptr;
  _columnCount = 0;
  _records = nullptr;
  _recordCount = 0;
  _recordCapacity = 0;
  _tableExists = false;
  _mutex = xSemaphoreCreateMutex();
  // Note: If mutex creation fails, operations will still work but won't be thread-safe.
  // Call isThreadSafe() to check if mutex initialization succeeded.
}

// Destructor
ESP32IMDB::~ESP32IMDB() {
  dropTable();
  if (_mutex != nullptr) {
    vSemaphoreDelete(_mutex);
  }
}

// Thread-safe lock
void ESP32IMDB::lock() const {
  if (_mutex != nullptr) {
    xSemaphoreTake(_mutex, portMAX_DELAY);
  }
}

// Thread-safe unlock
void ESP32IMDB::unlock() const {
  if (_mutex != nullptr) {
    xSemaphoreGive(_mutex);
  }
}

// Check if heap is above minimum limit
bool ESP32IMDB::checkHeapLimit() const {
  return ESP.getFreeHeap() >= IMDB_MIN_HEAP_BYTES;
}

// Create a new table
IMDBResult ESP32IMDB::createTable(const IMDBColumn* columns, uint8_t columnCount) {
  lock();
  
  if (_tableExists) {
    unlock();
    return IMDB_ERROR_TABLE_EXISTS;
  }
  
  if (columns == nullptr || columnCount == 0) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  if (!checkHeapLimit()) {
    unlock();
    return IMDB_ERROR_HEAP_LIMIT;
  }
  
  _columns = (IMDBColumn*)malloc(sizeof(IMDBColumn) * columnCount);
  if (_columns == nullptr) {
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  memcpy(_columns, columns, sizeof(IMDBColumn) * columnCount);
  _columnCount = columnCount;
  _tableExists = true;
  
  // Initial capacity for records
  _recordCapacity = 10;
  _records = (IMDBRecord*)malloc(sizeof(IMDBRecord) * _recordCapacity);
  if (_records == nullptr) {
    free(_columns);
    _columns = nullptr;
    _tableExists = false;
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  _recordCount = 0;
  
  unlock();
  return IMDB_OK;
}

// Drop the table and free all memory
IMDBResult ESP32IMDB::dropTable() {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  // Free all records
  for (int i = 0; i < _recordCount; i++) {
    freeRecord(&_records[i]);
  }
  
  // Free arrays
  free(_records);
  free(_columns);
  
  _records = nullptr;
  _columns = nullptr;
  _recordCount = 0;
  _recordCapacity = 0;
  _columnCount = 0;
  _tableExists = false;
  
  unlock();
  return IMDB_OK;
}

// Free a single record's allocated memory
void ESP32IMDB::freeRecord(IMDBRecord* record) {
  if (record->fields != nullptr) {
    // Free string fields
    if (_columns != nullptr) {
      for (int i = 0; i < _columnCount; i++) {
        if (_columns[i].type == IMDB_TYPE_STRING && record->fields[i].stringValue != nullptr) {
          free(record->fields[i].stringValue);
        }
      }
    }
    free(record->fields);
    record->fields = nullptr;
  }
}

// Find column index by name
int ESP32IMDB::findColumnIndex(const char* columnName) const {
  for (int i = 0; i < _columnCount; i++) {
    if (strcmp(_columns[i].name, columnName) == 0) {
      return i;
    }
  }
  return -1;
}

// Copy field value with proper memory allocation for strings
IMDBResult ESP32IMDB::copyFieldValue(IMDBFieldValue* dest, const void* src, IMDBDataType type) {
  switch (type) {
    case IMDB_TYPE_INT32:
      dest->int32Value = *(const int32_t*)src;
      break;
      
    case IMDB_TYPE_MAC:
      memcpy(dest->macAddress, src, 6);
      break;
      
    case IMDB_TYPE_STRING: {
      const char* srcStr = *(const char**)src;
      if (srcStr == nullptr) {
        return IMDB_ERROR_INVALID_VALUE;
      }
      size_t len = strlen(srcStr);
      if (len > IMDB_MAX_STRING_LENGTH) {
        len = IMDB_MAX_STRING_LENGTH;
      }
      // Allocate only needed space (compacted storage)
      dest->stringValue = (char*)malloc(len + 1);
      if (dest->stringValue == nullptr) {
        return IMDB_ERROR_OUT_OF_MEMORY;
      }
      strncpy(dest->stringValue, srcStr, len);
      dest->stringValue[len] = '\0';
      break;
    }
    
    case IMDB_TYPE_EPOCH:
      dest->epochValue = *(const uint32_t*)src;
      break;
      
    case IMDB_TYPE_BOOL:
      dest->boolValue = *(const bool*)src;
      break;
      
    case IMDB_TYPE_FLOAT:
      dest->floatValue = *(const float*)src;
      break;
  }
  
  return IMDB_OK;
}

// Check if a record is expired
bool ESP32IMDB::isRecordExpired(uint32_t expiryMillis) const {
  if (expiryMillis == 0) {
    return false;  // No expiry set
  }
  
  uint32_t currentMillis = millis();
  
  // Cast to int32_t to handle wraparound
  return (int32_t)(currentMillis - expiryMillis) >= 0;
}

// Purge expired records
void ESP32IMDB::purgeExpiredRecords() {
  lock();
  
  if (!_tableExists) {
    unlock();
    return;
  }
  
  for (int i = 0; i < _recordCount; i++) {
    if (_records[i].isValid && isRecordExpired(_records[i].expiryMillis)) {
      freeRecord(&_records[i]);
      _records[i].isValid = false;
    }
  }
  
  compactRecords();
  
  unlock();
}

// Compact records array by removing invalid entries
void ESP32IMDB::compactRecords() {
  int writeIndex = 0;
  for (int readIndex = 0; readIndex < _recordCount; readIndex++) {
    if (_records[readIndex].isValid) {
      if (writeIndex != readIndex) {
        _records[writeIndex] = _records[readIndex];
        // Clear the old slot to prevent stale pointers
        _records[readIndex].fields = nullptr;
        _records[readIndex].isValid = false;
      }
      writeIndex++;
    }
  }
  _recordCount = writeIndex;
  
  // Shrink array if significantly underutilized (less than 50% used)
  if (_recordCapacity > 10 && _recordCount < _recordCapacity / 2) {
    shrinkRecordArray();
  }
}

// Grow the records array capacity
IMDBResult ESP32IMDB::growRecordArray() {
  if (!checkHeapLimit()) {
    return IMDB_ERROR_HEAP_LIMIT;
  }
  
  // Check for potential overflow
  if (_recordCapacity > INT_MAX / 2) {
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  int newCapacity = _recordCapacity * 2;
  IMDBRecord* newRecords = (IMDBRecord*)realloc(_records, sizeof(IMDBRecord) * newCapacity);
  if (newRecords == nullptr) {
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  // Initialize new slots to prevent undefined behavior
  for (int i = _recordCapacity; i < newCapacity; i++) {
    newRecords[i].fields = nullptr;
    newRecords[i].isValid = false;
    newRecords[i].expiryMillis = 0;
  }
  
