Xorlent/ESP32IMDB/src/ESP32IMDB.cpp
  _records = newRecords;
  _recordCapacity = newCapacity;
  return IMDB_OK;
}

// Shrink the records array capacity to reclaim memory
IMDBResult ESP32IMDB::shrinkRecordArray() {
  // Calculate new capacity (half of current, but at least 10 and enough for records)
  int newCapacity = _recordCapacity / 2;
  if (newCapacity < 10) {
    newCapacity = 10;
  }
  if (newCapacity < _recordCount) {
    newCapacity = _recordCount;
  }
  
  // Don't bother if the reduction is minimal
  if (newCapacity >= _recordCapacity) {
    return IMDB_OK;
  }
  
  IMDBRecord* newRecords = (IMDBRecord*)realloc(_records, sizeof(IMDBRecord) * newCapacity);
  if (newRecords == nullptr) {
    // Shrinking failed, but this is not critical - keep the larger array
    return IMDB_OK;
  }
  
  _records = newRecords;
  _recordCapacity = newCapacity;
  return IMDB_OK;
}

// Insert a new record
IMDBResult ESP32IMDB::insert(const void** values, uint32_t ttlMillis) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (values == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  if (!checkHeapLimit()) {
    unlock();
    return IMDB_ERROR_HEAP_LIMIT;
  }
  
  // Validate TTL
  if (ttlMillis > IMDB_MAX_TTL_MS) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  // Grow array if needed
  if (_recordCount >= _recordCapacity) {
    IMDBResult result = growRecordArray();
    if (result != IMDB_OK) {
      unlock();
      return result;
    }
  }
  
  // Allocate record fields
  IMDBRecord* record = &_records[_recordCount];
  record->fields = (IMDBFieldValue*)malloc(sizeof(IMDBFieldValue) * _columnCount);
  if (record->fields == nullptr) {
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  // Initialize fields
  memset(record->fields, 0, sizeof(IMDBFieldValue) * _columnCount);
  
  // Copy values
  for (int i = 0; i < _columnCount; i++) {
    if (values[i] == nullptr) {
      // Cleanup on error
      for (int j = 0; j < i; j++) {
        if (_columns[j].type == IMDB_TYPE_STRING && record->fields[j].stringValue != nullptr) {
          free(record->fields[j].stringValue);
        }
      }
      free(record->fields);
      unlock();
      return IMDB_ERROR_INVALID_VALUE;
    }
    
    IMDBResult result = copyFieldValue(&record->fields[i], values[i], _columns[i].type);
    if (result != IMDB_OK) {
      // Cleanup on error
      for (int j = 0; j < i; j++) {
        if (_columns[j].type == IMDB_TYPE_STRING && record->fields[j].stringValue != nullptr) {
          free(record->fields[j].stringValue);
        }
      }
      free(record->fields);
      unlock();
      return result;
    }
  }
  
  // Set expiry TTL with overflow protection
  if (ttlMillis > 0) {
    uint32_t currentMillis = millis();
    // Check for potential overflow: if currentMillis + ttlMillis would overflow
    if (ttlMillis > (UINT32_MAX - currentMillis)) {
      // Set to maximum value to avoid wraparound
      record->expiryMillis = UINT32_MAX;
    } else {
      record->expiryMillis = currentMillis + ttlMillis;
    }
  } else {
    record->expiryMillis = 0;
  }

  record->isValid = true;
  _recordCount++;
  
  unlock();
  return IMDB_OK;
}

// Compare field values
bool ESP32IMDB::compareValues(const IMDBFieldValue* fieldValue, const void* compareValue, 
                             IMDBDataType type, IMDBOperator op) const {
  if (fieldValue == nullptr || compareValue == nullptr) {
    return false;
  }
  
  switch (type) {
    case IMDB_TYPE_INT32: {
      int32_t a = fieldValue->int32Value;
      int32_t b = *(const int32_t*)compareValue;
      switch (op) {
        case IMDB_OP_EQUAL: return a == b;
        case IMDB_OP_NOT_EQUAL: return a != b;
        case IMDB_OP_GREATER: return a > b;
        case IMDB_OP_LESS: return a < b;
        case IMDB_OP_GREATER_EQUAL: return a >= b;
        case IMDB_OP_LESS_EQUAL: return a <= b;
      }
      break;
    }
    
    case IMDB_TYPE_MAC:
      // Only equality supported for MAC
      return memcmp(fieldValue->macAddress, compareValue, 6) == 0;
      
    case IMDB_TYPE_STRING: {
      // Only equality supported for strings
      if (fieldValue->stringValue == nullptr || compareValue == nullptr) {
        return false;
      }
      const char* strToCompare = *(const char**)compareValue;
      if (strToCompare == nullptr) {
        return false;
      }
      return strcmp(fieldValue->stringValue, strToCompare) == 0;
    }
      
    case IMDB_TYPE_EPOCH: {
      uint32_t a = fieldValue->epochValue;
      uint32_t b = *(const uint32_t*)compareValue;
      switch (op) {
        case IMDB_OP_EQUAL: return a == b;
        case IMDB_OP_NOT_EQUAL: return a != b;
        case IMDB_OP_GREATER: return a > b;
        case IMDB_OP_LESS: return a < b;
        case IMDB_OP_GREATER_EQUAL: return a >= b;
        case IMDB_OP_LESS_EQUAL: return a <= b;
      }
      break;
    }
    
    case IMDB_TYPE_BOOL:
      return fieldValue->boolValue == *(const bool*)compareValue;
      
    case IMDB_TYPE_FLOAT: {
      float a = fieldValue->floatValue;
      float b = *(const float*)compareValue;
      float diff = a - b;
      switch (op) {
        case IMDB_OP_EQUAL: return (diff > -IMDB_FLOAT_EPSILON && diff < IMDB_FLOAT_EPSILON);
        case IMDB_OP_NOT_EQUAL: return (diff <= -IMDB_FLOAT_EPSILON || diff >= IMDB_FLOAT_EPSILON);
        case IMDB_OP_GREATER: return a > b;
        case IMDB_OP_LESS: return a < b;
        case IMDB_OP_GREATER_EQUAL: return a >= b;
        case IMDB_OP_LESS_EQUAL: return a <= b;
      }
      break;
    }
  }
  
  return false;
}

// Update records matching WHERE condition
IMDBResult ESP32IMDB::update(const char* whereColumn, const void* whereValue,
                            const char* setColumn, const void* setValue) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (whereColumn == nullptr || whereValue == nullptr || setColumn == nullptr || setValue == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  int whereIdx = findColumnIndex(whereColumn);
  int setIdx = findColumnIndex(setColumn);
  
  if (whereIdx < 0 || setIdx < 0) {
    unlock();
    return IMDB_ERROR_COLUMN_NOT_FOUND;
  }
  
  // Update matching records
  bool updated = false;
  for (int i = 0; i < _recordCount; i++) {
    if (!_records[i].isValid || isRecordExpired(_records[i].expiryMillis)) {
      continue;
    }
    
    if (compareValues(&_records[i].fields[whereIdx], whereValue, _columns[whereIdx].type)) {
      // For strings, allocate new value before freeing old to prevent data loss on failure
      if (_columns[setIdx].type == IMDB_TYPE_STRING) {
        char* oldString = _records[i].fields[setIdx].stringValue;
        _records[i].fields[setIdx].stringValue = nullptr;  // Temporarily clear to avoid double-free
        
        IMDBResult result = copyFieldValue(&_records[i].fields[setIdx], setValue, _columns[setIdx].type);
        if (result != IMDB_OK) {
          // Restore old value on failure
          _records[i].fields[setIdx].stringValue = oldString;
          unlock();
          return result;
        }
        // Success - now free the old value
        if (oldString != nullptr) {
          free(oldString);
        }
      } else {
        // Non-string types can be overwritten directly
        IMDBResult result = copyFieldValue(&_records[i].fields[setIdx], setValue, _columns[setIdx].type);
        if (result != IMDB_OK) {
          unlock();
          return result;
        }
      }
      updated = true;
    }
  }
  
  unlock();
  return updated ? IMDB_OK : IMDB_ERROR_NO_RECORDS;
}

// Simple float modulo implementation
static inline float floatModulo(float x, float y) {
  if (y == 0.0f) return 0.0f;
  return x - ((int)(x / y)) * y;
}

// Update with math operation
IMDBResult ESP32IMDB::updateWithMath(const char* whereColumn, const void* whereValue,
                                    const char* setColumn, IMDBMathOp operation, 
                                    int32_t operand) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
