Xorlent/ESP32IMDB/src/ESP32IMDB.cpp
  if (whereColumn == nullptr || whereValue == nullptr || setColumn == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  int whereIdx = findColumnIndex(whereColumn);
  int setIdx = findColumnIndex(setColumn);
  
  if (whereIdx < 0 || setIdx < 0) {
    unlock();
    return IMDB_ERROR_COLUMN_NOT_FOUND;
  }
  
  // Math operations only supported on INT32, EPOCH, and FLOAT types
  if (_columns[setIdx].type != IMDB_TYPE_INT32 && 
      _columns[setIdx].type != IMDB_TYPE_EPOCH && 
      _columns[setIdx].type != IMDB_TYPE_FLOAT) {
    unlock();
    return IMDB_ERROR_INVALID_TYPE;
  }
  
  // Update matching records
  bool updated = false;
  for (int i = 0; i < _recordCount; i++) {
    if (!_records[i].isValid || isRecordExpired(_records[i].expiryMillis)) {
      continue;
    }
    
    if (compareValues(&_records[i].fields[whereIdx], whereValue, _columns[whereIdx].type)) {
      if (_columns[setIdx].type == IMDB_TYPE_FLOAT) {
        // Float math operations
        float* valuePtr = &_records[i].fields[setIdx].floatValue;
        float floatOperand = (float)operand;
        
        switch (operation) {
          case IMDB_MATH_ADD:
            *valuePtr += floatOperand;
            break;
          case IMDB_MATH_SUBTRACT:
            *valuePtr -= floatOperand;
            break;
          case IMDB_MATH_MULTIPLY:
            *valuePtr *= floatOperand;
            break;
          case IMDB_MATH_DIVIDE:
            if (operand == 0) {
              unlock();
              return IMDB_ERROR_INVALID_OPERATION;
            }
            *valuePtr /= floatOperand;
            break;
          case IMDB_MATH_MODULO:
            if (operand == 0) {
              unlock();
              return IMDB_ERROR_INVALID_OPERATION;
            }
            *valuePtr = floatModulo(*valuePtr, floatOperand);
            break;
        }
      } else if (_columns[setIdx].type == IMDB_TYPE_INT32) {
        // INT32 math operations
        int32_t* valuePtr = &_records[i].fields[setIdx].int32Value;
        
        switch (operation) {
          case IMDB_MATH_ADD:
            *valuePtr += operand;
            break;
          case IMDB_MATH_SUBTRACT:
            *valuePtr -= operand;
            break;
          case IMDB_MATH_MULTIPLY:
            *valuePtr *= operand;
            break;
          case IMDB_MATH_DIVIDE:
            if (operand == 0) {
              unlock();
              return IMDB_ERROR_INVALID_OPERATION;
            }
            *valuePtr /= operand;
            break;
          case IMDB_MATH_MODULO:
            if (operand == 0) {
              unlock();
              return IMDB_ERROR_INVALID_OPERATION;
            }
            *valuePtr %= operand;
            break;
        }
      } else {
        // EPOCH math operations (treat as uint32_t to avoid aliasing)
        uint32_t* valuePtr = &_records[i].fields[setIdx].epochValue;
        
        switch (operation) {
          case IMDB_MATH_ADD:
            *valuePtr += (uint32_t)operand;
            break;
          case IMDB_MATH_SUBTRACT:
            *valuePtr -= (uint32_t)operand;
            break;
          case IMDB_MATH_MULTIPLY:
            *valuePtr *= (uint32_t)operand;
            break;
          case IMDB_MATH_DIVIDE:
            if (operand == 0) {
              unlock();
              return IMDB_ERROR_INVALID_OPERATION;
            }
            *valuePtr /= (uint32_t)operand;
            break;
          case IMDB_MATH_MODULO:
            if (operand == 0) {
              unlock();
              return IMDB_ERROR_INVALID_OPERATION;
            }
            *valuePtr %= (uint32_t)operand;
            break;
        }
      }
      updated = true;
    }
  }
  
  unlock();
  return updated ? IMDB_OK : IMDB_ERROR_NO_RECORDS;
}

// Delete records matching WHERE condition
IMDBResult ESP32IMDB::deleteRecords(const char* whereColumn, const void* whereValue) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (whereColumn == nullptr || whereValue == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  int whereIdx = findColumnIndex(whereColumn);
  if (whereIdx < 0) {
    unlock();
    return IMDB_ERROR_COLUMN_NOT_FOUND;
  }
  
  bool deleted = false;
  for (int i = 0; i < _recordCount; i++) {
    if (!_records[i].isValid) {
      continue;
    }
    
    if (compareValues(&_records[i].fields[whereIdx], whereValue, _columns[whereIdx].type)) {
      freeRecord(&_records[i]);
      _records[i].isValid = false;
      deleted = true;
    }
  }
  
  if (deleted) {
    compactRecords();
  }
  
  unlock();
  return deleted ? IMDB_OK : IMDB_ERROR_NO_RECORDS;
}

// Copy field value to result structure
void ESP32IMDB::getFieldValue(const IMDBFieldValue* field, IMDBDataType type, 
                             IMDBSelectResult* result) const {
  result->type = type;
  result->hasValue = true;
  
  switch (type) {
    case IMDB_TYPE_INT32:
      result->int32Value = field->int32Value;
      break;
    case IMDB_TYPE_MAC:
      memcpy(result->macAddress, field->macAddress, 6);
      break;
    case IMDB_TYPE_STRING:
      if (field->stringValue != nullptr) {
        strncpy(result->stringValue, field->stringValue, IMDB_MAX_STRING_LENGTH);
        result->stringValue[IMDB_MAX_STRING_LENGTH] = '\0';
      } else {
        result->stringValue[0] = '\0';
      }
      break;
    case IMDB_TYPE_EPOCH:
      result->epochValue = field->epochValue;
      break;
    case IMDB_TYPE_BOOL:
      result->boolValue = field->boolValue;
      break;
    case IMDB_TYPE_FLOAT:
      result->floatValue = field->floatValue;
      break;
  }
}

// Select a single column value from first matching record
IMDBResult ESP32IMDB::select(const char* column, const char* whereColumn,
                            const void* whereValue, IMDBSelectResult* result) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (column == nullptr || whereColumn == nullptr || whereValue == nullptr || result == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  int colIdx = findColumnIndex(column);
  int whereIdx = findColumnIndex(whereColumn);
  
  if (colIdx < 0 || whereIdx < 0) {
    unlock();
    return IMDB_ERROR_COLUMN_NOT_FOUND;
  }
  
  result->hasValue = false;
  
  for (int i = 0; i < _recordCount; i++) {
    if (!_records[i].isValid || isRecordExpired(_records[i].expiryMillis)) {
      continue;
    }
    
    if (compareValues(&_records[i].fields[whereIdx], whereValue, _columns[whereIdx].type)) {
      getFieldValue(&_records[i].fields[colIdx], _columns[colIdx].type, result);
      unlock();
      return IMDB_OK;
    }
  }
  
  unlock();
  return IMDB_ERROR_NO_RECORDS;
}

