Xorlent/ESP32IMDB/src/ESP32IMDB.cpp
// Select all matching records (caller must free results)
IMDBResult ESP32IMDB::selectAll(const char* whereColumn, const void* whereValue,
                               IMDBSelectResult** results, int* resultCount) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (whereColumn == nullptr || whereValue == nullptr || results == nullptr || resultCount == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  int whereIdx = findColumnIndex(whereColumn);
  if (whereIdx < 0) {
    unlock();
    return IMDB_ERROR_COLUMN_NOT_FOUND;
  }
  
  // Count matches first
  int matches = 0;
  for (int i = 0; i < _recordCount; i++) {
    if (_records[i].isValid && !isRecordExpired(_records[i].expiryMillis) &&
        compareValues(&_records[i].fields[whereIdx], whereValue, _columns[whereIdx].type)) {
      matches++;
    }
  }
  
  if (matches == 0) {
    *results = nullptr;
    *resultCount = 0;
    unlock();
    return IMDB_ERROR_NO_RECORDS;
  }
  
  // Allocate result array with overflow check
  // Check for potential integer overflow: matches * _columnCount
  if (matches > 0 && _columnCount > 0 && matches > (INT_MAX / _columnCount / (int)sizeof(IMDBSelectResult))) {
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;  // Would overflow
  }
  
  *results = (IMDBSelectResult*)malloc(sizeof(IMDBSelectResult) * matches * _columnCount);
  if (*results == nullptr) {
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  // Fill results
  int resultIdx = 0;
  for (int i = 0; i < _recordCount; i++) {
    if (_records[i].isValid && !isRecordExpired(_records[i].expiryMillis) &&
        compareValues(&_records[i].fields[whereIdx], whereValue, _columns[whereIdx].type)) {
      for (int col = 0; col < _columnCount; col++) {
        getFieldValue(&_records[i].fields[col], _columns[col].type, 
                     &(*results)[resultIdx * _columnCount + col]);
      }
      resultIdx++;
    }
  }
  
  *resultCount = matches;
  unlock();
  return IMDB_OK;
}

// Count all valid records
int32_t ESP32IMDB::count() {
  lock();
  
  if (!_tableExists) {
    unlock();
    return 0;
  }
  
  int32_t cnt = 0;
  for (int i = 0; i < _recordCount; i++) {
    if (_records[i].isValid && !isRecordExpired(_records[i].expiryMillis)) {
      cnt++;
    }
  }
  
  unlock();
  return cnt;
}

// Count records matching WHERE condition
int32_t ESP32IMDB::countWhere(const char* whereColumn, const void* whereValue) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return 0;
  }
  
  if (whereColumn == nullptr || whereValue == nullptr) {
    unlock();
    return 0;
  }
  
  int whereIdx = findColumnIndex(whereColumn);
  if (whereIdx < 0) {
    unlock();
    return 0;
  }
  
  int32_t cnt = 0;
  for (int i = 0; i < _recordCount; i++) {
    if (_records[i].isValid && !isRecordExpired(_records[i].expiryMillis) &&
        compareValues(&_records[i].fields[whereIdx], whereValue, _columns[whereIdx].type)) {
      cnt++;
    }
  }
  
  unlock();
  return cnt;
}

// Find minimum value in a column
IMDBResult ESP32IMDB::min(const char* column, IMDBSelectResult* result) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (column == nullptr || result == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  int colIdx = findColumnIndex(column);
  if (colIdx < 0) {
    unlock();
    return IMDB_ERROR_COLUMN_NOT_FOUND;
  }
  
  // Only numeric types supported
  IMDBDataType type = _columns[colIdx].type;
  if (type != IMDB_TYPE_INT32 && type != IMDB_TYPE_EPOCH && type != IMDB_TYPE_FLOAT) {
    unlock();
    return IMDB_ERROR_INVALID_TYPE;
  }
  
  result->hasValue = false;
  int32_t minVal = INT32_MAX;  // Max int32
  uint32_t minEpoch = UINT32_MAX;  // Max uint32 for EPOCH
  float minFloat = 3.4028235e38f;  // Max float
  
  for (int i = 0; i < _recordCount; i++) {
    if (!_records[i].isValid || isRecordExpired(_records[i].expiryMillis)) {
      continue;
    }
    
    if (type == IMDB_TYPE_FLOAT) {
      float val = _records[i].fields[colIdx].floatValue;
      if (!result->hasValue || val < minFloat) {
        minFloat = val;
        result->hasValue = true;
      }
    } else if (type == IMDB_TYPE_INT32) {
      int32_t val = _records[i].fields[colIdx].int32Value;
      if (!result->hasValue || val < minVal) {
        minVal = val;
        result->hasValue = true;
      }
    } else {  // IMDB_TYPE_EPOCH
      uint32_t val = _records[i].fields[colIdx].epochValue;
      if (!result->hasValue || val < minEpoch) {
        minEpoch = val;
        result->hasValue = true;
      }
    }
  }
  
  if (!result->hasValue) {
    unlock();
    return IMDB_ERROR_NO_RECORDS;
  }
  
  result->type = type;
  if (type == IMDB_TYPE_INT32) {
    result->int32Value = minVal;
  } else if (type == IMDB_TYPE_EPOCH) {
    result->epochValue = minEpoch;
  } else {
    result->floatValue = minFloat;
  }
  
  unlock();
  return IMDB_OK;
}

// Find maximum value in a column
IMDBResult ESP32IMDB::max(const char* column, IMDBSelectResult* result) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (column == nullptr || result == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  int colIdx = findColumnIndex(column);
  if (colIdx < 0) {
    unlock();
    return IMDB_ERROR_COLUMN_NOT_FOUND;
  }
  
  // Only numeric types supported
  IMDBDataType type = _columns[colIdx].type;
  if (type != IMDB_TYPE_INT32 && type != IMDB_TYPE_EPOCH && type != IMDB_TYPE_FLOAT) {
    unlock();
    return IMDB_ERROR_INVALID_TYPE;
  }
  
  result->hasValue = false;
  int32_t maxVal = INT32_MIN;  // Minimum int32 value
  uint32_t maxEpoch = 0;  // Min uint32 for EPOCH
  float maxFloat = -3.4028235e38f;  // Min float (close to -FLT_MAX)
  
  for (int i = 0; i < _recordCount; i++) {
    if (!_records[i].isValid || isRecordExpired(_records[i].expiryMillis)) {
      continue;
    }
    
    if (type == IMDB_TYPE_FLOAT) {
      float val = _records[i].fields[colIdx].floatValue;
      if (!result->hasValue || val > maxFloat) {
        maxFloat = val;
        result->hasValue = true;
      }
    } else if (type == IMDB_TYPE_INT32) {
      int32_t val = _records[i].fields[colIdx].int32Value;
      if (!result->hasValue || val > maxVal) {
        maxVal = val;
        result->hasValue = true;
      }
    } else {  // IMDB_TYPE_EPOCH
      uint32_t val = _records[i].fields[colIdx].epochValue;
      if (!result->hasValue || val > maxEpoch) {
        maxEpoch = val;
        result->hasValue = true;
      }
    }
  }
  
  if (!result->hasValue) {
    unlock();
    return IMDB_ERROR_NO_RECORDS;
  }
  
  result->type = type;
  if (type == IMDB_TYPE_INT32) {
    result->int32Value = maxVal;
  } else if (type == IMDB_TYPE_EPOCH) {
    result->epochValue = maxEpoch;
  } else {
    result->floatValue = maxFloat;
  }
  
  unlock();
  return IMDB_OK;
}

// Get top N records (caller must free results)
IMDBResult ESP32IMDB::top(int n, IMDBSelectResult** results, int* resultCount) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (results == nullptr || resultCount == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  // Count valid records
  int validCount = 0;
  for (int i = 0; i < _recordCount; i++) {
    if (_records[i].isValid && !isRecordExpired(_records[i].expiryMillis)) {
      validCount++;
    }
  }
  
