Xorlent/ESP32IMDB/src/ESP32IMDB.cpp
  if (validCount == 0) {
    *results = nullptr;
    *resultCount = 0;
    unlock();
    return IMDB_ERROR_NO_RECORDS;
  }
  
  int returnCount = (n < validCount) ? n : validCount;
  
  // Allocate result array with overflow check
  // Check for potential integer overflow: returnCount * _columnCount
  if (returnCount > 0 && _columnCount > 0 && returnCount > (INT_MAX / _columnCount / (int)sizeof(IMDBSelectResult))) {
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;  // Would overflow
  }
  
  *results = (IMDBSelectResult*)malloc(sizeof(IMDBSelectResult) * returnCount * _columnCount);
  if (*results == nullptr) {
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  // Fill results
  int resultIdx = 0;
  for (int i = 0; i < _recordCount && resultIdx < returnCount; i++) {
    if (_records[i].isValid && !isRecordExpired(_records[i].expiryMillis)) {
      for (int col = 0; col < _columnCount; col++) {
        getFieldValue(&_records[i].fields[col], _columns[col].type,
                     &(*results)[resultIdx * _columnCount + col]);
      }
      resultIdx++;
    }
  }
  
  *resultCount = returnCount;
  unlock();
  return IMDB_OK;
}

// Get total number of records (including invalid)
int ESP32IMDB::getRecordCount() const {
  lock();
  int count = _recordCount;
  unlock();
  return count;
}

// Estimate memory usage
size_t ESP32IMDB::getMemoryUsage() const {
  lock();
  
  size_t total = 0;
  
  // Column definitions
  total += sizeof(IMDBColumn) * _columnCount;
  
  // Record array
  total += sizeof(IMDBRecord) * _recordCapacity;
  
  // Fields in each record
  if (_columns != nullptr && _records != nullptr) {
    for (int i = 0; i < _recordCount; i++) {
      if (_records[i].fields != nullptr) {
        total += sizeof(IMDBFieldValue) * _columnCount;
        
        // String allocations
        for (int j = 0; j < _columnCount; j++) {
          if (_columns[j].type == IMDB_TYPE_STRING && _records[i].fields[j].stringValue != nullptr) {
            total += strlen(_records[i].fields[j].stringValue) + 1;
          }
        }
      }
    }
  }
  
  unlock();
  return total;
}

// Helper function to validate hexadecimal character
static bool isHexChar(char c) {
  return (c >= '0' && c <= '9') || 
         (c >= 'a' && c <= 'f') || 
         (c >= 'A' && c <= 'F');
}

// Parse MAC address from string (supports multiple formats)
bool ESP32IMDB::parseMacAddress(const char* macStr, uint8_t* macBytes) {
  if (macStr == nullptr || macBytes == nullptr) {
    return false;
  }
  
  // Validate string length before operations to prevent buffer overruns
  size_t len = strlen(macStr);
  if (len != 12 && len != 17) {
    return false;  // Invalid length for MAC address
  }
  
  // Check for 12-character format (no delimiters): aabbccddeeff
  if (len == 12) {
    // Validate all characters are hex
    for (int i = 0; i < 12; i++) {
      if (!isHexChar(macStr[i])) {
        return false;
      }
    }
    
    // Parse hex pairs
    for (int i = 0; i < 6; i++) {
      char hex[3] = {macStr[i*2], macStr[i*2+1], '\0'};
      macBytes[i] = (uint8_t)strtol(hex, nullptr, 16);
    }
    return true;
  }
  
  // Check for 17-character format with delimiters: aa:bb:cc:dd:ee:ff or aa-bb-cc-dd-ee-ff
  if (len == 17) {
    char delimiter = macStr[2];
    if (delimiter != ':' && delimiter != '-') {
      return false;
    }
    
    for (int i = 0; i < 6; i++) {
      int pos = i * 3;
      
      // Validate hex characters for this octet
      if (!isHexChar(macStr[pos]) || !isHexChar(macStr[pos + 1])) {
        return false;
      }
      
      char hex[3] = {macStr[pos], macStr[pos + 1], '\0'};
      macBytes[i] = (uint8_t)strtol(hex, nullptr, 16);
      
      // Check delimiters
      if (i < 5 && macStr[pos + 2] != delimiter) {
        return false;
      }
    }
    return true;
  }
  
  return false;
}

// Format MAC address as colon-separated string (output is 18 bytes)
void ESP32IMDB::formatMacAddress(const uint8_t* macBytes, char* output) {
  if (macBytes == nullptr || output == nullptr) {
    if (output != nullptr) {
      output[0] = '\0';
    }
    return;
  }
  
  sprintf(output, "%02x:%02x:%02x:%02x:%02x:%02x",
          macBytes[0], macBytes[1], macBytes[2],
          macBytes[3], macBytes[4], macBytes[5]);
}

// Check if the database is thread-safe (mutex was created successfully)
bool ESP32IMDB::isThreadSafe() const {
  return _mutex != nullptr;
}

// Free memory allocated by selectAll() or top() functions
void ESP32IMDB::freeSelectResults(IMDBSelectResult* results) {
  if (results != nullptr) {
    free(results);
  }
}

#if IMDB_ENABLE_PERSISTENCE

// Save database to SPIFFS file
IMDBResult ESP32IMDB::saveToFile(const char* filename) {
  lock();
  
  if (!_tableExists) {
    unlock();
    return IMDB_ERROR_NO_TABLE;
  }
  
  if (filename == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  // Purge expired records before saving (inline to avoid deadlock)
  for (int i = 0; i < _recordCount; i++) {
    if (_records[i].isValid && isRecordExpired(_records[i].expiryMillis)) {
      freeRecord(&_records[i]);
      _records[i].isValid = false;
    }
  }
  compactRecords();
  
  // Check record count limit for file format (uint16_t)
  if (_recordCount > 65535) {
    unlock();
    return IMDB_ERROR_INVALID_OPERATION;  // Too many records for file format
  }
  
  // Create temporary filename for atomic write
  char tempFilename[256];
  snprintf(tempFilename, sizeof(tempFilename), "%s.tmp", filename);
  
  // Open file for writing
  File file = SPIFFS.open(tempFilename, "w");
  if (!file) {
    unlock();
    return IMDB_ERROR_FILE_OPEN;
  }
  
  // Write header
  const char magic[4] = {'I', 'M', 'D', 'B'};
  const uint8_t version = 1;
  uint16_t recordCount = (uint16_t)_recordCount;
  uint32_t saveMillis = millis();
  
  if (file.write((const uint8_t*)magic, 4) != 4) {
    file.close();
    SPIFFS.remove(tempFilename);
    unlock();
    return IMDB_ERROR_FILE_WRITE;
  }
  
  if (file.write(&version, 1) != 1) {
    file.close();
    SPIFFS.remove(tempFilename);
    unlock();
    return IMDB_ERROR_FILE_WRITE;
  }
  
