Xorlent/ESP32IMDB/src/ESP32IMDB.cpp
  if (file.write(&_columnCount, 1) != 1) {
    file.close();
    SPIFFS.remove(tempFilename);
    unlock();
    return IMDB_ERROR_FILE_WRITE;
  }
  
  if (file.write((const uint8_t*)&recordCount, 2) != 2) {
    file.close();
    SPIFFS.remove(tempFilename);
    unlock();
    return IMDB_ERROR_FILE_WRITE;
  }
  
  if (file.write((const uint8_t*)&saveMillis, 4) != 4) {
    file.close();
    SPIFFS.remove(tempFilename);
    unlock();
    return IMDB_ERROR_FILE_WRITE;
  }
  
  // Write schema
  for (int i = 0; i < _columnCount; i++) {
    if (file.write((const uint8_t*)_columns[i].name, 32) != 32) {
      file.close();
      SPIFFS.remove(tempFilename);
      unlock();
      return IMDB_ERROR_FILE_WRITE;
    }
    
    uint8_t typeValue = (uint8_t)_columns[i].type;
    if (file.write(&typeValue, 1) != 1) {
      file.close();
      SPIFFS.remove(tempFilename);
      unlock();
      return IMDB_ERROR_FILE_WRITE;
    }
  }
  
  // Write records
  for (int i = 0; i < _recordCount; i++) {
    IMDBRecord* record = &_records[i];
    
    // Write isValid flag
    uint8_t isValid = record->isValid ? 1 : 0;
    if (file.write(&isValid, 1) != 1) {
      file.close();
      SPIFFS.remove(tempFilename);
      unlock();
      return IMDB_ERROR_FILE_WRITE;
    }
    
    // Write expiryMillis
    if (file.write((const uint8_t*)&record->expiryMillis, 4) != 4) {
      file.close();
      SPIFFS.remove(tempFilename);
      unlock();
      return IMDB_ERROR_FILE_WRITE;
    }
    
    // Write fields
    for (int j = 0; j < _columnCount; j++) {
      IMDBFieldValue* field = &record->fields[j];
      IMDBDataType type = _columns[j].type;
      
      switch (type) {
        case IMDB_TYPE_INT32:
          if (file.write((const uint8_t*)&field->int32Value, 4) != 4) {
            file.close();
            SPIFFS.remove(tempFilename);
            unlock();
            return IMDB_ERROR_FILE_WRITE;
          }
          break;
          
        case IMDB_TYPE_FLOAT:
          if (file.write((const uint8_t*)&field->floatValue, 4) != 4) {
            file.close();
            SPIFFS.remove(tempFilename);
            unlock();
            return IMDB_ERROR_FILE_WRITE;
          }
          break;
          
        case IMDB_TYPE_BOOL: {
          uint8_t boolValue = field->boolValue ? 1 : 0;
          if (file.write(&boolValue, 1) != 1) {
            file.close();
            SPIFFS.remove(tempFilename);
            unlock();
            return IMDB_ERROR_FILE_WRITE;
          }
          break;
        }
        
        case IMDB_TYPE_MAC:
          if (file.write(field->macAddress, 6) != 6) {
            file.close();
            SPIFFS.remove(tempFilename);
            unlock();
            return IMDB_ERROR_FILE_WRITE;
          }
          break;
          
        case IMDB_TYPE_EPOCH:
          if (file.write((const uint8_t*)&field->epochValue, 4) != 4) {
            file.close();
            SPIFFS.remove(tempFilename);
            unlock();
            return IMDB_ERROR_FILE_WRITE;
          }
          break;
          
        case IMDB_TYPE_STRING: {
          uint8_t length = 0;
          if (field->stringValue) {
            size_t strLen = strlen(field->stringValue);
            // Clamp to max string length for safety
            length = (strLen > IMDB_MAX_STRING_LENGTH) ? IMDB_MAX_STRING_LENGTH : (uint8_t)strLen;
          }
          if (file.write(&length, 1) != 1) {
            file.close();
            SPIFFS.remove(tempFilename);
            unlock();
            return IMDB_ERROR_FILE_WRITE;
          }
          
          if (length > 0) {
            if (file.write((const uint8_t*)field->stringValue, length) != length) {
              file.close();
              SPIFFS.remove(tempFilename);
              unlock();
              return IMDB_ERROR_FILE_WRITE;
            }
          }
          break;
        }
      }
    }
  }
  
  file.close();
  
  // Atomic rename - replace old file with new one
  if (SPIFFS.exists(filename)) {
    SPIFFS.remove(filename);
  }
  if (!SPIFFS.rename(tempFilename, filename)) {
    SPIFFS.remove(tempFilename);
    unlock();
    return IMDB_ERROR_FILE_WRITE;
  }
  
  unlock();
  return IMDB_OK;
}

// Load database from SPIFFS file
IMDBResult ESP32IMDB::loadFromFile(const char* filename) {
  lock();
  
  if (filename == nullptr) {
    unlock();
    return IMDB_ERROR_INVALID_VALUE;
  }
  
  // Check if table already exists - don't overwrite
  if (_tableExists) {
    unlock();
    return IMDB_ERROR_TABLE_EXISTS;
  }
  
  // Check if file exists first
  if (!SPIFFS.exists(filename)) {
    unlock();
    return IMDB_ERROR_FILE_OPEN;
  }
  
  // Open file for reading
  File file = SPIFFS.open(filename, "r");
  if (!file) {
    unlock();
    return IMDB_ERROR_FILE_OPEN;
  }
  
  // Read and validate header
  char magic[4];
  if (file.read((uint8_t*)magic, 4) != 4 || 
      magic[0] != 'I' || magic[1] != 'M' || magic[2] != 'D' || magic[3] != 'B') {
    file.close();
    unlock();
    return IMDB_ERROR_CORRUPT_FILE;
  }
  
  uint8_t version;
  if (file.read(&version, 1) != 1 || version != 1) {
    file.close();
    unlock();
    return IMDB_ERROR_CORRUPT_FILE;
  }
  
  uint8_t columnCount;
  if (file.read(&columnCount, 1) != 1) {
    file.close();
    unlock();
    return IMDB_ERROR_CORRUPT_FILE;
  }
  
  uint16_t recordCount;
  if (file.read((uint8_t*)&recordCount, 2) != 2) {
    file.close();
    unlock();
    return IMDB_ERROR_CORRUPT_FILE;
  }
  
  uint32_t saveMillis;
  if (file.read((uint8_t*)&saveMillis, 4) != 4) {
    file.close();
    unlock();
    return IMDB_ERROR_CORRUPT_FILE;
  }
  
  // Read schema
  if (!checkHeapLimit()) {
    file.close();
    unlock();
    return IMDB_ERROR_HEAP_LIMIT;
  }
  
  _columns = (IMDBColumn*)malloc(sizeof(IMDBColumn) * columnCount);
  if (_columns == nullptr) {
    file.close();
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  for (int i = 0; i < columnCount; i++) {
    if (file.read((uint8_t*)_columns[i].name, 32) != 32) {
      free(_columns);
      _columns = nullptr;
      file.close();
      unlock();
      return IMDB_ERROR_FILE_READ;
    }
    // Ensure null-termination of column name for safety
    _columns[i].name[31] = '\0';
    
    uint8_t typeValue;
    if (file.read(&typeValue, 1) != 1) {
      free(_columns);
      _columns = nullptr;
      file.close();
      unlock();
      return IMDB_ERROR_FILE_READ;
    }
    // Validate type value is within valid enum range
    if (typeValue > IMDB_TYPE_FLOAT) {
      free(_columns);
      _columns = nullptr;
      file.close();
      unlock();
      return IMDB_ERROR_CORRUPT_FILE;
    }
    _columns[i].type = (IMDBDataType)typeValue;
  }
  
