Xorlent/ESP32IMDB/src/ESP32IMDB.cpp
  _columnCount = columnCount;
  _tableExists = true;
  
  // Allocate records array
  if (!checkHeapLimit()) {
    free(_columns);
    _columns = nullptr;
    _tableExists = false;
    file.close();
    unlock();
    return IMDB_ERROR_HEAP_LIMIT;
  }
  
  _recordCapacity = recordCount > 10 ? recordCount : 10;
  _records = (IMDBRecord*)malloc(sizeof(IMDBRecord) * _recordCapacity);
  if (_records == nullptr) {
    free(_columns);
    _columns = nullptr;
    _tableExists = false;
    file.close();
    unlock();
    return IMDB_ERROR_OUT_OF_MEMORY;
  }
  
  _recordCount = 0;
  uint32_t currentMillis = millis();
  
  // Read records
  for (int i = 0; i < recordCount; i++) {
    IMDBRecord record;
    
    // Read isValid flag
    uint8_t isValid;
    if (file.read(&isValid, 1) != 1) {
      // Cleanup on error
      for (int j = 0; j < _recordCount; j++) {
        freeRecord(&_records[j]);
      }
      free(_records);
      free(_columns);
      _records = nullptr;
      _columns = nullptr;
      _recordCount = 0;
      _recordCapacity = 0;
      _tableExists = false;
      file.close();
      unlock();
      return IMDB_ERROR_FILE_READ;
    }
    record.isValid = (isValid != 0);
    
    // Read expiryMillis
    uint32_t savedExpiryMillis;
    if (file.read((uint8_t*)&savedExpiryMillis, 4) != 4) {
      for (int j = 0; j < _recordCount; j++) {
        freeRecord(&_records[j]);
      }
      free(_records);
      free(_columns);
      _records = nullptr;
      _columns = nullptr;
      _recordCount = 0;
      _recordCapacity = 0;
      _tableExists = false;
      file.close();
      unlock();
      return IMDB_ERROR_FILE_READ;
    }
    
    // Adjust TTL based on time difference
    if (savedExpiryMillis == 0) {
      record.expiryMillis = 0;  // No expiry
    } else {
      // Calculate remaining time, handling potential underflow
      if (savedExpiryMillis > saveMillis) {
        uint32_t remainingMillis = savedExpiryMillis - saveMillis;
        // Check for overflow when adding to currentMillis
        if (remainingMillis > (UINT32_MAX - currentMillis)) {
          record.expiryMillis = UINT32_MAX;
        } else {
          record.expiryMillis = currentMillis + remainingMillis;
        }
      } else {
        // Record was already expired when saved, mark as expired now
        record.expiryMillis = currentMillis - 1;
      }
    }
    
    // Allocate fields array
    if (!checkHeapLimit()) {
      for (int j = 0; j < _recordCount; j++) {
        freeRecord(&_records[j]);
      }
      free(_records);
      free(_columns);
      _records = nullptr;
      _columns = nullptr;
      _recordCount = 0;
      _recordCapacity = 0;
      _tableExists = false;
      file.close();
      unlock();
      return IMDB_ERROR_HEAP_LIMIT;
    }
    
    record.fields = (IMDBFieldValue*)malloc(sizeof(IMDBFieldValue) * _columnCount);
    if (record.fields == nullptr) {
      for (int j = 0; j < _recordCount; j++) {
        freeRecord(&_records[j]);
      }
      free(_records);
      free(_columns);
      _records = nullptr;
      _columns = nullptr;
      _recordCount = 0;
      _recordCapacity = 0;
      _tableExists = false;
      file.close();
      unlock();
      return IMDB_ERROR_OUT_OF_MEMORY;
    }
    
    // Initialize string pointers to nullptr
    for (int j = 0; j < _columnCount; j++) {
      if (_columns[j].type == IMDB_TYPE_STRING) {
        record.fields[j].stringValue = nullptr;
      }
    }
    
    // Read fields
    bool readError = false;
    for (int j = 0; j < _columnCount; j++) {
      IMDBFieldValue* field = &record.fields[j];
      IMDBDataType type = _columns[j].type;
      
      switch (type) {
        case IMDB_TYPE_INT32:
          if (file.read((uint8_t*)&field->int32Value, 4) != 4) {
            readError = true;
          }
          break;
          
        case IMDB_TYPE_FLOAT:
          if (file.read((uint8_t*)&field->floatValue, 4) != 4) {
            readError = true;
          }
          break;
          
        case IMDB_TYPE_BOOL: {
          uint8_t boolValue;
          if (file.read(&boolValue, 1) != 1) {
            readError = true;
          } else {
            field->boolValue = (boolValue != 0);
          }
          break;
        }
        
        case IMDB_TYPE_MAC:
          if (file.read(field->macAddress, 6) != 6) {
            readError = true;
          }
          break;
          
        case IMDB_TYPE_EPOCH:
          if (file.read((uint8_t*)&field->epochValue, 4) != 4) {
            readError = true;
          }
          break;
          
        case IMDB_TYPE_STRING: {
          uint8_t length;
          if (file.read(&length, 1) != 1) {
            readError = true;
            break;
          }
          
          // Validate string length
          if (length > IMDB_MAX_STRING_LENGTH) {
            readError = true;
            break;
          }
          
          if (length > 0) {
            field->stringValue = (char*)malloc(length + 1);
            if (field->stringValue == nullptr) {
              readError = true;
              break;
            }
            
            if (file.read((uint8_t*)field->stringValue, length) != length) {
              free(field->stringValue);
              field->stringValue = nullptr;
              readError = true;
              break;
            }
            field->stringValue[length] = '\0';
          } else {
            field->stringValue = nullptr;
          }
          break;
        }
      }
      
      if (readError) {
        break;
      }
    }
    
    if (readError) {
      // Free this record's fields
      for (int j = 0; j < _columnCount; j++) {
        if (_columns[j].type == IMDB_TYPE_STRING && record.fields[j].stringValue != nullptr) {
          free(record.fields[j].stringValue);
        }
      }
      free(record.fields);
      
