Xorlent/ESP32IMDB/src/ESP32IMDB.cpp
      // Cleanup all previous records
      for (int j = 0; j < _recordCount; j++) {
        freeRecord(&_records[j]);
      }
      free(_records);
      free(_columns);
      _records = nullptr;
      _columns = nullptr;
      _recordCount = 0;
      _recordCapacity = 0;
      _tableExists = false;
      file.close();
      unlock();
      return IMDB_ERROR_FILE_READ;
    }
    
    // Add record to array
    _records[_recordCount] = record;
    _recordCount++;
  }
  
  file.close();
  unlock();
  return IMDB_OK;
}

#endif // IMDB_ENABLE_PERSISTENCE

// Convert result code to string
const char* ESP32IMDB::resultToString(IMDBResult result) {
  switch (result) {
    case IMDB_OK: return "OK";
    case IMDB_ERROR_OUT_OF_MEMORY: return "Out of memory";
    case IMDB_ERROR_HEAP_LIMIT: return "Heap limit exceeded";
    case IMDB_ERROR_TABLE_EXISTS: return "Table already exists";
    case IMDB_ERROR_NO_TABLE: return "No table exists";
    case IMDB_ERROR_INVALID_TYPE: return "Invalid data type";
    case IMDB_ERROR_INVALID_VALUE: return "Invalid value";
    case IMDB_ERROR_COLUMN_COUNT_MISMATCH: return "Column count mismatch";
    case IMDB_ERROR_COLUMN_NOT_FOUND: return "Column not found";
    case IMDB_ERROR_INVALID_OPERATION: return "Invalid operation";
    case IMDB_ERROR_NO_RECORDS: return "No records found";
    case IMDB_ERROR_INVALID_MAC_FORMAT: return "Invalid MAC address format";
#if IMDB_ENABLE_PERSISTENCE
    case IMDB_ERROR_FILE_OPEN: return "Failed to open file";
    case IMDB_ERROR_FILE_WRITE: return "Failed to write to file";
    case IMDB_ERROR_FILE_READ: return "Failed to read from file";
    case IMDB_ERROR_CORRUPT_FILE: return "Corrupt or invalid file format";
#endif
    default: return "Unknown error";
  }
}
